12/data/attachments/d1ec0a1e794e519d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Kristopher_prevent_Friend_22982_0</nif:username>
            <nif:friendToBeRequested>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>